src/test/resources/soapRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
    <soap:Body>
        <m:GetPrice xmlns:m="http://www.example.org/stock">
            <m:StockName>EXAMPLE</m:StockName>
        </m:GetPrice>
    </soap:Body>
</soap:Envelope>